src/test/resources/samples/request12.soap

<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://ws.integclaims.itf.com">
   <soapenv:Header/>
   <soapenv:Body>
      <ws:claimxmlClaimNotifyImmediate soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
         <username xsi:type="xsd:string">webservice</username>
         <password xsi:type="xsd:string">password</password>
         <externalSystemCode xsi:type="xsd:string">integclaims</externalSystemCode>
         <xml xsi:type="xsd:string">&lt;?xml version="1.0" encoding="UTF-8"?&gt;&lt;cn:claimnotification xmlns:cn="http://www.itf.com/claimnotification" xmlns:dd="http://www.itf.com/icedomaindata" xmlns:rd="http://www.itf.com/icereferencedata" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.itf.com/claimnotification file:/home/matt/Web/webnol/docs/icexml/claimnotification-0104.xsd"&gt;
  &lt;source&gt;WEBNOL&lt;/source&gt;
    &lt;externalclaimreference&gt;QUIN0001-1234&lt;/externalclaimreference&gt;
    &lt;event&gt;
      &lt;dd:motorevent xmlns:ns-ed35e13e="http://www.itf.com/icedomaindata"&gt;
        &lt;dd:eventtype&gt;ACCIDENT&lt;/dd:eventtype&gt;
        &lt;dd:eventcause&gt;POLICYHOLDERHITINREAR&lt;/dd:eventcause&gt;
        &lt;dd:eventsubcause&gt;POLICYHOLDERHITINREAR&lt;/dd:eventsubcause&gt;
        &lt;dd:eventdate&gt;2015-03-29&lt;/dd:eventdate&gt;
        &lt;dd:eventtime&gt;10:15:00&lt;/dd:eventtime&gt;
        &lt;dd:liabilityind&gt;N&lt;/dd:liabilityind&gt;
      &lt;/dd:motorevent&gt;
    &lt;/event&gt;
    &lt;policy&gt;
      &lt;dd:schemecode xmlns:ns-ed35e13e="http://www.itf.com/icedomaindata"&gt;MOTOR_SCHEME_1&lt;/dd:schemecode&gt;
      &lt;dd:producttype xmlns:ns-ed35e13e="http://www.itf.com/icedomaindata"&gt;MOTOR&lt;/dd:producttype&gt;
      &lt;dd:policynumber xmlns:ns-ed35e13e="http://www.itf.com/icedomaindata"&gt;6378467&lt;/dd:policynumber&gt;
      &lt;dd:offering&gt;Comprehensive&lt;/dd:offering&gt;
    &lt;/policy&gt;
    &lt;policyholder&gt;
      &lt;dd:person xmlns:ns-ed35e13e="http://www.itf.com/icedomaindata"&gt;
        &lt;dd:contactpoints&gt;
          &lt;dd:telephonemobile&gt;070 7691 5315&lt;/dd:telephonemobile&gt;
          &lt;dd:email&gt;LeonShah@dayrep.com&lt;/dd:email&gt;
        &lt;/dd:contactpoints&gt;
        &lt;dd:title&gt;DR&lt;/dd:title&gt;
        &lt;dd:forename&gt;Leon&lt;/dd:forename&gt;
        &lt;dd:surname&gt;Shah&lt;/dd:surname&gt;
        &lt;dd:personstate&gt;
          &lt;dd:treatedatscene&gt;Y&lt;/dd:treatedatscene&gt;
          &lt;dd:takentohospital&gt;Y&lt;/dd:takentohospital&gt;
          &lt;dd:injuries&gt;
            &lt;dd:injury&gt;
              &lt;dd:type&gt;204&lt;/dd:type&gt;
            &lt;/dd:injury&gt;
          &lt;/dd:injuries&gt;
        &lt;/dd:personstate&gt;
        &lt;dd:notifierrole&gt;PHREP&lt;/dd:notifierrole&gt;
      &lt;/dd:person&gt;
    &lt;/policyholder&gt;
    &lt;insuredobject&gt;
      &lt;dd:vehicle xmlns:ns-ed35e13e="http://www.itf.com/icedomaindata"&gt;
        &lt;dd:make&gt;ASTON_MARTIN_MOCR&lt;/dd:make&gt;
        &lt;dd:model&gt;DBS_V8_ASTON_MARTIN_MOCR&lt;/dd:model&gt;
        &lt;dd:registrationnumber&gt;CF62 KLF&lt;/dd:registrationnumber&gt;
        &lt;dd:state&gt;
          &lt;dd:damagenotes&gt;Ut a nisl id ante tempus hendrerit. Donec mi odio, faucibus at, scelerisque quis, convallis in, nisi. Cras id dui. Vivamus aliquet elit ac nisl. Cras sagittis.&lt;/dd:damagenotes&gt;
          &lt;dd:drivable&gt;N&lt;/dd:drivable&gt;
        &lt;/dd:state&gt;
      &lt;/dd:vehicle&gt;
    &lt;/insuredobject&gt;
    &lt;thirdparties&gt;
      &lt;dd:party xmlns:ns-ed35e13e="http://www.itf.com/icedomaindata"&gt;
        &lt;dd:person&gt;
          &lt;dd:contactpoints&gt;
            &lt;dd:telephonemobile&gt;078 5091 9009&lt;/dd:telephonemobile&gt;
            &lt;dd:email&gt;MohammadHudson@teleworm.us&lt;/dd:email&gt;
          &lt;/dd:contactpoints&gt;
          &lt;dd:thirdpartydetails&gt;
            &lt;dd:thirdpartyobject&gt;
              &lt;dd:vehicle&gt;
                &lt;dd:make&gt;PEUGEOT_MOCR&lt;/dd:make&gt;
                &lt;dd:model&gt;307_GLX_16V_PEUGEOT_MOCR&lt;/dd:model&gt;
                &lt;dd:registrationnumber&gt;PE10 LCF&lt;/dd:registrationnumber&gt;
                &lt;dd:state&gt;
                  &lt;dd:damagenotes&gt;Morbi vestibulum volutpat enim. Donec mollis hendrerit risus. Phasellus dolor. Nunc nonummy metus. Cum sociis natoque penatibus et magnis dis parturient montes, nascetur ridiculus mus.&lt;/dd:damagenotes&gt;
                  &lt;dd:drivable&gt;Y&lt;/dd:drivable&gt;
                &lt;/dd:state&gt;
              &lt;/dd:vehicle&gt;
            &lt;/dd:thirdpartyobject&gt;
          &lt;/dd:thirdpartydetails&gt;
          &lt;dd:title&gt;MR&lt;/dd:title&gt;
          &lt;dd:forename&gt;Mohammad&lt;/dd:forename&gt;
          &lt;dd:surname&gt;Hudson&lt;/dd:surname&gt;
          &lt;dd:personstate&gt;
            &lt;dd:treatedatscene&gt;Y&lt;/dd:treatedatscene&gt;
            &lt;dd:takentohospital&gt;N&lt;/dd:takentohospital&gt;
            &lt;dd:injuries&gt;
              &lt;dd:injury&gt;
                &lt;dd:type&gt;101&lt;/dd:type&gt;
              &lt;/dd:injury&gt;
            &lt;/dd:injuries&gt;
          &lt;/dd:personstate&gt;
          &lt;dd:notifierrole&gt;TP&lt;/dd:notifierrole&gt;
        &lt;/dd:person&gt;
      &lt;/dd:party&gt;
    &lt;/thirdparties&gt;
    &lt;witnesses&gt;
      &lt;dd:witness xmlns:ns-ed35e13e="http://www.itf.com/icedomaindata"&gt;
        &lt;dd:contactpoints&gt;
          &lt;dd:telephonemobile&gt;079 5388 8372&lt;/dd:telephonemobile&gt;
          &lt;dd:email&gt;EllaRandall@teleworm.us&lt;/dd:email&gt;
        &lt;/dd:contactpoints&gt;
        &lt;dd:title&gt;MISS&lt;/dd:title&gt;
        &lt;dd:forename&gt;Ella&lt;/dd:forename&gt;
        &lt;dd:surname&gt;Randall&lt;/dd:surname&gt;
        &lt;dd:notifierrole&gt;FRIEND&lt;/dd:notifierrole&gt;
      &lt;/dd:witness&gt;
    &lt;/witnesses&gt;
    &lt;notes&gt;
      &lt;dd:note xmlns:ns-ed35e13e="http://www.itf.com/icedomaindata"&gt;
        &lt;dd:details&gt;Donec vitae sapien ut libero venenatis faucibus. Praesent ac sem eget est egestas volutpat. Curabitur at lacus ac velit ornare lobortis. Duis arcu tortor, suscipit eget, imperdiet nec, imperdiet iaculis, ipsum. Fusce risus nisl, viverra et, tempor et, pretium in, sapien.&lt;/dd:details&gt;
      &lt;/dd:note&gt;
    &lt;/notes&gt;
  &lt;/cn:claimnotification&gt;</xml>
      </ws:claimxmlClaimNotifyImmediate>
   </soapenv:Body>
</soapenv:Envelope>